# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'shivammathur/php'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'starship'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Development
brew 'shivammathur/php/php@8.0'
brew 'shivammathur/php/php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'meilisearch'
brew 'memcached'
brew 'node'
brew 'yarn'
brew 'deployer'
brew 'wget'

# Apps
cask 'aerial'
cask 'alfred'
cask 'bettertouchtool'
cask 'dbngin'
cask 'docker'
cask 'docker'
cask 'firefox'
cask 'forklift'
cask 'github'
cask 'google-chrome'
cask 'hyper'
cask 'imageoptim'
cask 'opera'
cask 'openemu'
cask 'phpstorm'
cask 'ray'
cask 'tableplus'
cask 'tinkerwell'
cask 'transmission'
cask 'zoom'
cask 'postman'
cask 'typora'
cask 'teamviewer'
cask 'paragon-ntfs'
cask 'graphql-playground'
cask 'pycharm'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-fira-code'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Affinity Photo', id: 824183456
mas 'Keynote', id: 409183694
mas 'Elmedia Video Player', id: 1044549675
mas 'GIPHY Capture. The GIF Maker', id: 668208984
mas 'Keynote', id: 409183694
mas 'Slack', id: 803453959
mas 'Pages', id: 409201541
mas 'WhatsApp', id: 1147396723
mas 'Telegram', id: 747648890
mas 'JSONPeep', id: 1458969831
mas 'BetterSnapTool', id: 417375580
mas 'TickTick', id: 966085870
mas 'Speedtest', id: 1153157709
mas 'Numbers', id: 409203825
