# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'shivammathur/php'

# Binaries
brew 'bash'
brew 'coreutils'
brew 'ffmpeg'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'mas'
brew 'pkg-config'
brew 'tree'
brew 'rsync'
brew 'zlib'

# Development
brew 'shivammathur/php/php@8.2'
brew 'shivammathur/php/php@8.1'
brew 'shivammathur/php/php@8.0'
brew 'shivammathur/php/php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'meilisearch'
brew 'memcached'
brew 'node'
brew 'yarn'
brew 'deployer'
brew 'wget'

# Apps
cask '1password'
cask '1password-cli'
cask 'affinity-photo'
cask 'anydesk'
cask 'bettertouchtool'
cask 'dbngin'
cask 'docker'
cask 'expressvpn'
cask 'figma'
cask 'forklift'
cask 'google-chrome'
cask 'microsoft-excel'
cask 'microsoft-word'
cask 'microsoft-remote-desktop'
cask 'microsoft-teams'
cask 'notion'
cask 'openemu'
cask 'paragon-ntfs'
cask 'phpstorm'
cask 'postman'
cask 'quitter'
cask 'ray'
cask 'raycast'
cask 'slack'
cask 'steam'
cask 'tableplus'
cask 'teamviewer'
cask 'telegram'
cask 'the-unarchiver'
cask 'ticktick'
cask 'tinkerwell'
cask 'transmission'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'warp'
cask 'whatsapp'
cask 'zoom'

# Quicklook
cask 'quicklook-json'
cask 'quicklook-csv'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-fira-code'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Speedtest', id: 1153157709
